// ### Задача 5.1: Группировка по четности
// Напишите метод `groupByParity(int[] arr)`, который возвращает `Map<String, List<Integer>>` с ключами "even" и "odd", содержащими соответствующие числа.

// **Пример:**
// groupByParity(new int[]{1, 2, 3, 4, 5, 6})
// // должно вернуть Map с {"even": [2, 4, 6], "odd": [1, 3, 5]}

import java.util.Map;
import java.util.HashMap;
import java.util.List;
import java.util.ArrayList;

public class Main {
    public static void main(String[] args){
        System.out.println(groupByParity(new int[]{1, 2, 3, 4, 5, 6}));
    }

    public static Map<String,List<Integer>> groupByParity(int[] mass){
        Map<String,List<Integer>> map = new HashMap<>();
        


        return map
    }
}
